<h1> Panda Dataframes </h1>

<p> If you've worked in R, you're already familiar with the general concept of dataframes. You probably know the
same concept by different names in other languages and tools too -- it's just data organized into a table, with
columns of specific variables and rows of observations </p>

<p> Technically, in Pandas, a DataFrame is a composed of Series with a shared index; each Series is a column, and
each index value is a row. </p>

<h2> Creating a Panda Dataframe </h2>

<p> We can create a DataFrame from series by creating a dictionary associating each series with a column name,
like this: </p>

In [1]:
import pandas
import random

dates = pandas.date_range('1/1/2000', periods=120, freq='M') # create a list of 120 dates, starting  January 1, 2000, 
                                                             # incremented by 1 month


ts1 = pandas.Series([random.normalvariate(0,1) for x in range(120)], index=dates)
ts2 = pandas.Series([random.normalvariate(0,1) for x in range(120)], index=dates)
ts1 = ts1.cumsum()
ts2 = ts2.cumsum()


df = pandas.DataFrame({"Column1": ts1, "Column2": ts2})

In [9]:
df

              Column1    Column2
2000-01-31  -0.321829  -1.735891
2000-02-29  -0.914268  -1.481103
2000-03-31   0.101797  -1.176621
2000-04-30   1.221134   0.044792
2000-05-31   1.726044   1.137000
2000-06-30   1.714007   1.089871
2000-07-31   2.567738   0.254439
2000-08-31   1.592573   1.341344
2000-09-30   1.397019   0.185584
2000-10-31   1.412941  -0.315829
2000-11-30   0.552583  -0.859290
2000-12-31   1.364963  -2.162421
2001-01-31   2.569648  -3.188907
2001-02-28   2.452076  -2.997649
2001-03-31   2.900731  -2.659978
2001-04-30   4.049248   0.017300
2001-05-31   0.732682   0.447329
2001-06-30   0.981584  -0.742811
2001-07-31  -0.372237  -0.594911
2001-08-31   0.064400  -0.636903
2001-09-30  -0.265589   0.935590
2001-10-31  -0.202377   0.797361
2001-11-30  -0.615163   0.776010
2001-12-31  -0.828173   1.969460
2002-01-31  -2.472527   1.392722
2002-02-28  -2.185900   1.942566
2002-03-31  -1.218282   1.969931
2002-04-30  -0.049631   1.421112
2002-05-31  -0.848886   1.396291
2002-06-30  -1.197209   2.115021
...               ...        ...
2007-07-31  10.375963 -10.892340
2007-08-31  10.490887 -11.670701
2007-09-30  11.203748 -13.755187
2007-10-31  10.212614 -13.744984
2007-11-30   9.451319 -13.448996
2007-12-31   9.506937 -13.899540
2008-01-31   8.911851 -14.235438
2008-02-29   9.238023 -14.220827
2008-03-31   9.505325 -14.309131
2008-04-30   8.334155 -14.517812
2008-05-31   6.291862 -14.231235
2008-06-30   4.608101 -14.726798
2008-07-31   6.966601 -15.961596
2008-08-31   6.581198 -15.563191
2008-09-30   6.279766 -15.218152
2008-10-31   6.983998 -17.670411
2008-11-30   6.872468 -18.156083
2008-12-31   7.166619 -19.475359
2009-01-31   6.918732 -17.999284
2009-02-28   7.595446 -19.589021
2009-03-31   8.832729 -18.360002
2009-04-30   7.794085 -18.618105
2009-05-31   7.351411 -18.294367
2009-06-30   7.969676 -16.675064
2009-07-31   6.806484 -16.370622
2009-08-31   7.777411 -16.622169
2009-09-30   8.777822 -16.835628
2009-10-31   8.964207 -16.716131
2009-11-30   8.152751 -17.091817
2009-12-31   9.097141 -16.644581

[120 rows x 2 columns]

<h2> Pandas - Dataframe info(), head() tail() methods, column, dtypes, index attribute </h2>

Viewing the DataFrame may either display the whole thing, or else just a quick summary of the index and the
columns, depending on the version of pandas you have and how it's conigured. To view the summary, use the
.info() method:

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 120 entries, 2000-01-31 00:00:00 to 2009-12-31 00:00:00
Freq: M
Data columns (total 2 columns):
Column1    120 non-null float64
Column2    120 non-null float64
dtypes: float64(2)

The column headers are stored in the columns property:

In [12]:
df.columns

Index([u'Column1', u'Column2'], dtype='object')

We can quickly see the data types of each column using the dtypes property:

In [13]:
df.dtypes

Column1    float64
Column2    float64
dtype: object

And we can see the index using the index property:

In [16]:
df.index # The index is a datetime, just like it was for the series. Each row is associated with a date.

<class 'pandas.tseries.index.DatetimeIndex'>
[2000-01-31, ..., 2009-12-31]
Length: 120, Freq: M, Timezone: None

We can quickly look at the top and bottom rows using the head() and tail() methods.

In [15]:
df.head()

             Column1   Column2
2000-01-31 -0.321829 -1.735891
2000-02-29 -0.914268 -1.481103
2000-03-31  0.101797 -1.176621
2000-04-30  1.221134  0.044792
2000-05-31  1.726044  1.137000

In [17]:
df.tail(2) # A number specifies how many rows to include

             Column1    Column2
2009-11-30  8.152751 -17.091817
2009-12-31  9.097141 -16.644581

<h2> Pandas dataframe corr() method </h2>

Using the corr() method will produce a correlation table for all the columns in the DataFrame

In [18]:
df.corr()

          Column1   Column2
Column1  1.000000 -0.560091
Column2 -0.560091  1.000000

<h2> Panda dataframe columns </h2>

Selecting columns
There are two ways to access specific columns within the DataFrame. The first is by putting the columns name
(in quotation marks) in square brackets

In [20]:
df["Column1"]

2000-01-31   -0.321829
2000-02-29   -0.914268
2000-03-31    0.101797
2000-04-30    1.221134
2000-05-31    1.726044
2000-06-30    1.714007
2000-07-31    2.567738
2000-08-31    1.592573
2000-09-30    1.397019
2000-10-31    1.412941
2000-11-30    0.552583
2000-12-31    1.364963
2001-01-31    2.569648
2001-02-28    2.452076
2001-03-31    2.900731
...
2008-10-31    6.983998
2008-11-30    6.872468
2008-12-31    7.166619
2009-01-31    6.918732
2009-02-28    7.595446
2009-03-31    8.832729
2009-04-30    7.794085
2009-05-31    7.351411
2009-06-30    7.969676
2009-07-31    6.806484
2009-08-31    7.777411
2009-09-30    8.777822
2009-10-31    8.964207
2009-11-30    8.152751
2009-12-31    9.097141
Freq: M, Name: Column1, Length: 120

If there are no spaces in the column name, we can also reference it as a property:

In [21]:
df.Column2 #If there are no spaces in the column name, we can also reference it as a property:

2000-01-31   -1.735891
2000-02-29   -1.481103
2000-03-31   -1.176621
2000-04-30    0.044792
2000-05-31    1.137000
2000-06-30    1.089871
2000-07-31    0.254439
2000-08-31    1.341344
2000-09-30    0.185584
2000-10-31   -0.315829
2000-11-30   -0.859290
2000-12-31   -2.162421
2001-01-31   -3.188907
2001-02-28   -2.997649
2001-03-31   -2.659978
...
2008-10-31   -17.670411
2008-11-30   -18.156083
2008-12-31   -19.475359
2009-01-31   -17.999284
2009-02-28   -19.589021
2009-03-31   -18.360002
2009-04-30   -18.618105
2009-05-31   -18.294367
2009-06-30   -16.675064
2009-07-31   -16.370622
2009-08-31   -16.622169
2009-09-30   -16.835628
2009-10-31   -16.716131
2009-11-30   -17.091817
2009-12-31   -16.644581
Freq: M, Name: Column2, Length: 120

<h2> Adding a column to a dataframe </h2>

The square bracket notation is also how we create new columns:

In [23]:
df["New Column"] = 1  #"New Column" is the column name.  It assigns 1 to all rows 
df.head()

             Column1   Column2  New Column
2000-01-31 -0.321829 -1.735891           1
2000-02-29 -0.914268 -1.481103           1
2000-03-31  0.101797 -1.176621           1
2000-04-30  1.221134  0.044792           1
2000-05-31  1.726044  1.137000           1

Notice that since there's a space in the name, we can't reference it as df. anything

<h2> Working with real data - Reading data into a Pandas dataframe </h2>

<p>Playing with toy data is fine, but to really dive into pandas let's use it to replicate and expand on some of our
analysis last week.</p>

<p> We can load a CSV file into a pandas DataFrame using the read_csv(...) function. Let's step through and try to
load last week's MovieData.csv:  </p>

In [24]:
movies = pandas.read_csv("MovieData.csv")

CParserError: Error tokenizing data. C error: Expected 1 fields in line 38, saw 2

That's a scary-looking error, but read down to the end. "Error tokenizing data" probably means that there's an
issue splitting the data into columns. It turns out that read_csv assumes by default that the data is commadelimited.
We need to explicitly give it a separator ('sep') if it's something different, like this:

In [2]:
movies = pandas.read_csv("MovieData.csv", sep='\t')

In [5]:
# it looks like the read_csv routine creates an index of integers when we we read in a file.
movies.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            3617, 3618, 3619, 3620, 3621, 3622, 3623, 3624, 3625, 3626],
           dtype='int64', length=3627)

Okay, no errors now! Let's see what it's loaded:

In [3]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3627 entries, 0 to 3626
Data columns (total 6 columns):
Release_Date       3627 non-null object
Movie              3627 non-null object
Distributor        2968 non-null object
Budget             3627 non-null int64
US Gross           3627 non-null object
Worldwide Gross    3627 non-null object
dtypes: int64(1), object(5)
memory usage: 198.4+ KB

In [29]:
movies.columns

Index([u'Release_Date', u'Movie', u'Distributor', u'Budget', u'US Gross', u'Worldwide Gross'], dtype='object')

In [30]:
 movies.dtypes

Release_Date       object
Movie              object
Distributor        object
Budget              int64
US Gross           object
Worldwide Gross    object
dtype: object

<p>Looks pretty good, up until the end. We've got the correct column names, and a correct-seeming number of
values. But we know that Budget, US Gross and Worldwide Gross are all supposed to be numbers; why is it
reading them in as objects (which, in cases like this, generally means 'strings', since Pandas doesn't provide an
explicit string datatype the way it does for ints and floats). </p>

<h2> Pandas dataframe unique() method </h2>

<p>As you may remember from last week, missing values were actually filled with a text string denoting this.
Helpfully, read_csv lets you specify one or more 'na_values' which it should read as indicating missing data. To
figure out what we should include there, however, we can use the unique() method, which returns all the unique
values of a Series: </p>

In [31]:
movies["US Gross"].unique()

array(['66439100', '309420425', 'Unknown', ..., '48482', '1338', '181041'], dtype=object)

Ah, see it? It's the word 'Unknown', so let's give that as our N/A Value:

In [32]:
movies = pandas.read_csv("MovieData.csv", sep='\t', na_values="Unknown")

In [33]:
movies.dtypes

Release_Date        object
Movie               object
Distributor         object
Budget               int64
US Gross           float64
Worldwide Gross     object
dtype: object

Almost there! US Gross is now a numeric column, but Worldwide Gross isn't. So let's check again:

In [35]:
movies["Worldwide Gross"].unique()

array(['254439100', '960996492', nan, ..., '71644', '240495', 'Unkno'], dtype=object)

It looks like at least one record has 'Unkno' as its value. Luckily, we can pass na_values a list of values, and it
will treat all of them as indicators of no data.

(Incidentally, to make your code more readable, you can insert line-breaks inside of parentheses, and Python
will treat them as the same line)

In [36]:
 movies = pandas.read_csv("MovieData.csv", sep='\t',na_values=["Unknown", "Unkno"])

In [37]:
movies.head()

,Release_Date,Movie,Distributor,Budget,US Gross,Worldwide Gross
0,03/09/12,John Carter,NaN,300000000,66439100,254439100
1,05/25/07,Pirates of the Caribbean: At World's End,Buena Vista,300000000,309420425,960996492
2,12/13/13,The Hobbit: There and Back Again,New Line,270000000,NaN,NaN
3,12/14/12,The Hobbit: An Unexpected Journey,New Line,270000000,NaN,NaN
4,11/24/10,Tangled,Buena Vista,260000000,200821936,586581936

<h2> Pandas dataframe.fillna() method </h2>

Notice the 'NaN' cells -- NaN stands for Not a Number. If we want, we can replace NaN values with 0s using
the fillna(...) method:

In [39]:
movies = movies.fillna(0)
movies.head()

,Release_Date,Movie,Distributor,Budget,US Gross,Worldwide Gross
0,03/09/12,John Carter,0,300000000,66439100,254439100
1,05/25/07,Pirates of the Caribbean: At World's End,Buena Vista,300000000,309420425,960996492
2,12/13/13,The Hobbit: There and Back Again,New Line,270000000,0,0
3,12/14/12,The Hobbit: An Unexpected Journey,New Line,270000000,0,0
4,11/24/10,Tangled,Buena Vista,260000000,200821936,586581936

<h2> Panda dataframes - parsing dates using read_csv </h2>

Like before, though, we want to be able to actually work with the dates. We can tell pandas to parse one or
more columns as dates when it loads the data, using the parse_dates parameter. If we assign a list of column
numbers to it, it will attempt to automatically parse those columns as dates:

In [41]:
movies = pandas.read_csv("MovieData.csv", sep='\t', na_values=["Unknown", "Unkno"], parse_dates=[0])

In [42]:
movies.dtypes

Release_Date       datetime64[ns]
Movie                      object
Distributor                object
Budget                      int64
US Gross                  float64
Worldwide Gross           float64
dtype: object

In [43]:
min(movies["Release_Date"])

Timestamp('1965-02-15 00:00:00')

In [44]:
max(movies.Release_Date)

Timestamp('2064-12-22 00:00:00')

<h3> Providing a custom date parser </h3> 

So it looks like the built-in date parser isn't very good at figuring out which dates are in the 20th century, and
which are in the 21st. Fortunately, we already solved this problem last week; we can bring in our custom parser,
and tell Pandas to use that, using the date_parser parameter.

In [48]:
import datetime as dt
def make_date(date_str):
    '''
    Turn a MM/DD/YY string into a datetime object
    '''
    m, d, y = date_str.split("/")
    m = int(m)
    d = int(d)
    y = int(y)
    if y > 13:
        y += 1900
    else:
        y += 2000
    return dt.datetime(y, m, d)

In [49]:
movies = pandas.read_csv("MovieData.csv", sep='\t', na_values=["Unknown","Unkno"],parse_dates=[0], date_parser=make_date)

Notice that we're only passing the name of the function, without the usual parentheses. Conceptually, think of
this as simply passing the name of our parser function, which the read_csv(...) function can call on its own. For
each entry, pandas will automatically call the function, and put its return value in the column. (More technically,
functions in Python are first-class objects, and can be passed as arguments just like any other data type).

In [50]:
print movies.Release_Date.max()
print movies.Release_Date.min()

2013-12-13 00:00:00
1915-02-08 00:00:00

There, that's better.

<h2> Creating new dataframe columns from other columns </h2>

I mentioned earlier that we can easily create columns from other columns. Now that we have data, let's look at
it again:

In [53]:

movies["Non_US_Gross"] = movies["Worldwide Gross"] - movies["US Gross"]

For each movie, the value of the "Non_US_Gross" will be its Worldwide Gross minus its US Gross. The
underscore in the name aren't mandatory, but they let us reference the column like this:

In [54]:
movies.Non_US_Gross.min()

0.0

<h2> dataframe column describe method </h2>

As you see above, min() (and max() as well) are built-in series functions, which can be called for columns as well.
In fact, there are several standard ways of describing a set of numbers (i.e. a series); we can get them all
together using the describe() method.

In [55]:
 movies["Profits"] = movies["Worldwide Gross"]/movies["Budget"]

In [57]:
movies.Profits.describe() # Gives basic column stats

count     2350.000000
mean        11.293342
std        271.249795
min          0.001058
25%          1.093912
50%          2.314627
75%          4.470410
max      13112.110400
dtype: float64

<h2> Subsetting dataframes - like sql where clause -  </h2>

Just because we have one big dataset doesn't mean we want to work with it all at once. Often, we want to be
able to select only a subset of the data. In pandas, we do this by putting the condition we're selecting on in
square brackets. For example, if we want only big-budget movies, where the budget exceeds $20M, we would
use the following code:

In [58]:
big_budget = movies[movies.Budget > 20000000]

In [59]:
big_budget.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1657 entries, 0 to 1656
Data columns (total 8 columns):
Release_Date       1657 non-null datetime64[ns]
Movie              1657 non-null object
Distributor        1485 non-null object
Budget             1657 non-null int64
US Gross           1637 non-null float64
Worldwide Gross    1357 non-null float64
Non_US_Gross       1351 non-null float64
Profits            1357 non-null float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)

In [60]:
#We can also check when the first movie in our dataset crossed the $20M budget threshold:
print big_budget.Release_Date.min()

1963-06-12 00:00:00

Notice that any new columns we created (Profits, in this case) also become part of the subsetted dataframe:

In [61]:
big_budget.Profits.describe()

count    1357.000000
mean        2.873381
std         2.674981
min         0.025012
25%         1.140839
50%         2.184805
75%         3.625537
max        24.475977
dtype: float64

<h2> dataframe grouping - like an sql group by clause and aggregation function</h2>

<p>Often, what you care about aren't individual records, but summaries aggregated at some level. For example,
you may want to know how many movies were released each year, or whether certain months of the year have
more earthquakes than others.
</p>

<p>Pandas uses the Split-Apply-Combine paradigm; we split the data into groups, apply a certain calculation to
each group separately, and combine the results back into a new data structure.
</p>

<p>Let's start by getting the annual mean of each numeric column: finding the average US Gross, Worldwide
Gross, etc. by year. </p>

<p> First, we need to create a new column to aggregate on -- the Release Year. Since the values of the
Release_Date column are datetime-like objects, they have a year property: </p>

In [63]:
movies.Release_Date[19].year # Some arbitrary row

2005

<h3> Apply Method - Create a new column from other columns with a user provided function </h3>

To create a new column based on another column, with an operation that isn't basic arithmetic, we use the
apply(...) method. This method takes another function as an input, and applies it (hence the name) to each value
in a column or series. The function being applied should take a single value as an input, and produce a similar
output which can be assigned to the new series.

In [64]:
# this is our custom function which parses out the year from a date value
def get_year(date):
    return date.year

In [65]:
# now we create a new column, in which our custom function is applied to an existing column
movies["Year"] = movies.Release_Date.apply(get_year)

<p> In fact, we don't even have to define an entire function; Python allows us to use the lambda keyword to create
a simple one-line function directly inside the apply(...) parentheses (you may have encountered this concept as
anonymous functions in other languages).
</p>

We could simplify the lines above to:

In [67]:
movies["Year"] = movies.Release_Date.apply(lambda x: x.year)

In [68]:
print movies.Year.min()
print movies.Year.max()

1915
2013

Now that we've created a Year column, we need to divide the data by its different values. We go this using the
DataFrame's groupby(...) method, like this:

In [69]:
#by_year is a special object that provides ability to do aggregate type functions on a data frame.
by_year = movies.groupby('Year')

<p> The argument we give groupby(...) is the name of the column to group by. The result of the method, which is
assigned here to by_year is a special pandas object that stores a grouped dataframe. The groups themselves
are stored as a dictionary, associating group labels (e.g. years, in this case) with the indices of all the rows that
belong to that group. </p>

In [70]:
 print by_year.groups.keys()

[1915, 1916, 1920, 1925, 1927, 1929, 1930, 1931, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013]

In [71]:
 by_year.groups[1916]

[3501L, 3558L]


We can carry out operations on the grouped object to yield aggragated DataFrames.

<p>
The simplest of the operations built-in to the grouped data object is mean(), which simply returns the mean of
each column for each of the groups -- in this case, the mean of each column by year. The result is a new
DataFrame, indexed by year:
</p>

In [73]:
annual_means = by_year.mean()

In [74]:
annual_means.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 89 entries, 1915 to 2013
Data columns (total 5 columns):
Budget             89 non-null int64
US Gross           85 non-null float64
Worldwide Gross    59 non-null float64
Non_US_Gross       59 non-null float64
Profits            59 non-null float64
dtypes: float64(4), int64(1)

In [75]:
annual_means.head()

       Budget  US Gross  Worldwide Gross  Non_US_Gross     Profits
Year
1915   110000  10000000         11000000       1000000  100.000000
1916   292953   8000000              NaN           NaN         NaN
1920   100000   3000000              NaN           NaN         NaN
1925  2072500  10000000         22000000      11000000   89.795918
1927  2000000       NaN              NaN           NaN         NaN

We can apply our own functions to each group as well, by passing them to the group object's aggregate(...)
method. For example, if we want a count of how many movies were released in each year, we could simply
pass Python's built-in len function, to count the length of each group:

In [76]:
counts = by_year.aggregate(len)

In [77]:
counts.head()

,Release_Date,Movie,Distributor,Budget,US Gross,Worldwide Gross,Non_US_Gross,Profits
Year,,,,,,,,
1915,1970-01-01 00:00:00.000000001,1,1,1,1,1,1,1
1916,1970-01-01 00:00:00.000000002,2,2,2,2,2,2,2
1920,1970-01-01 00:00:00.000000001,1,1,1,1,1,1,1
1925,1970-01-01 00:00:00.000000002,2,2,2,2,2,2,2
1927,1970-01-01 00:00:00.000000001,1,1,1,1,1,1,1

In [78]:
counts.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 89 entries, 1915 to 2013
Data columns (total 8 columns):
Release_Date       89 non-null datetime64[ns]
Movie              89 non-null int64
Distributor        89 non-null int64
Budget             89 non-null int64
US Gross           89 non-null float64
Worldwide Gross    89 non-null float64
Non_US_Gross       89 non-null float64
Profits            89 non-null float64
dtypes: datetime64[ns](1), float64(4), int64(3)

<p>Notice how all the columns (except the first one) in each row have the same value -- we're just counting the
number of rows per group (movies per year, in this case), which won't vary from column to column. (The
Release_Date column 'remembers' that it's holding a date, and converts the count number accordingly). </p>

<p>

In fact, there's no need for a whole data frame: the count of movies per year is just a series. If we only want a
single series, we can select a column from the grouped object just like from a DataFrame. For the movie counts,
it doesn't matter which column we pick (with the exception of the Release_Date column).
</p>

In [79]:
# specifing a single column to count
counts = by_year.Movie.aggregate(len)

In [81]:
print counts

Year
1915    1
1916    2
1920    1
1925    2
1927    1
1929    1
1930    1
1931    1
1933    3
1934    1
1935    1
1936    3
1937    1
1938    2
1939    3
...
1999    179
2000    189
2001    176
2002    207
2003    186
2004    196
2005    211
2006    229
2007    178
2008    177
2009    172
2010    212
2011    154
2012     30
2013      1
Name: Movie, Length: 89, dtype: int64

<h2> Merging dataframes - like a SQL join </h2>

<p> You'll frequently find yourself working with more than one dataset at a time, or needing to combine data from
several sources for analysis. Fortunately, pandas makes this simple as well. </p>

<p>
For this example, suppose we're interested in how movies are affected by the state of the American economy.</p>

<p>
First, let's put together three series: the number of movies released per year, their average budget, and their
average profit.
</p>

<p>
The latter two come from the annual_means DataFrame. We can create a DataFrame by subsetting a list of
columns from another DataFrame, like this:
</p>

In [82]:
annual_data = annual_means[["Budget", "Profits"]]

In [83]:
annual_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 89 entries, 1915 to 2013
Data columns (total 2 columns):
Budget     89 non-null int64
Profits    59 non-null float64
dtypes: float64(1), int64(1)

<h3> Renaming dataframe columns </h3>

<p> To make it clear that we're looking at averages now, we may want to rename the columns. We do this using the
rename method, and passing a dictionary to the columns argument, associating the old names and new names
for columns we want to rename:
</p>

In [85]:
annual_data = annual_data.rename(columns={"Budget": "Mean_Budget", "Profits": "Mean_Profit"})

In [86]:
annual_data.head()

      Mean_Budget  Mean_Profit
Year
1915       110000   100.000000
1916       292953          NaN
1920       100000          NaN
1925      2072500    89.795918
1927      2000000          NaN

In [87]:
annual_data.tail()

      Mean_Budget  Mean_Profit
Year
2009     42974651    91.226580
2010     39710400     3.276562
2011     43270404     3.934096
2012     75050300     9.694820
2013    270000000          NaN

Since the counts dataframe and annual_data datafraem have overlapping index values, pandas automatically knows how to merge them.

In [89]:
#Now we want to add the movie count. In this case, we can simply assign it like this:
annual_data["Count"] = counts

In [90]:
annual_data.head()

      Mean_Budget  Mean_Profit  Count
Year
1915       110000   100.000000      1
1916       292953          NaN      2
1920       100000          NaN      1
1925      2072500    89.795918      2
1927      2000000          NaN      1

In [91]:
annual_data.tail()

      Mean_Budget  Mean_Profit  Count
Year
2009     42974651    91.226580    172
2010     39710400     3.276562    212
2011     43270404     3.934096    154
2012     75050300     9.694820     30
2013    270000000          NaN      1

Next, let's load an additional dataset to merge in. We'll load a simple time series with annual unemployment
rates. After loading the dataset above, this is a piece of cake:

In [92]:
 unemp = pandas.read_csv("Unemployment.csv")

In [93]:
unemp

    Year  Unemployment
0   1948           3.8
1   1949           6.1
2   1950           5.2
3   1951           3.3
4   1952           3.0
5   1953           2.9
6   1954           5.6
7   1955           4.4
8   1956           4.1
9   1957           4.3
10  1958           6.8
11  1959           5.5
12  1960           5.5
13  1961           6.7
14  1962           5.6
15  1963           5.6
16  1964           5.2
17  1965           4.5
18  1966           3.8
19  1967           3.8
20  1968           3.6
21  1969           3.5
22  1970           5.0
23  1971           6.0
24  1972           5.6
25  1973           4.9
26  1974           5.6
27  1975           8.5
28  1976           7.7
29  1977           7.1
..   ...           ...
35  1983           9.6
36  1984           7.5
37  1985           7.2
38  1986           7.0
39  1987           6.2
40  1988           5.5
41  1989           5.3
42  1990           5.6
43  1991           6.9
44  1992           7.5
45  1993           6.9
46  1994           6.1
47  1995           5.6
48  1996           5.4
49  1997           4.9
50  1998           4.5
51  1999           4.2
52  2000           4.0
53  2001           4.7
54  2002           5.8
55  2003           6.0
56  2004           5.5
57  2005           5.1
58  2006           4.6
59  2007           4.6
60  2008           5.8
61  2009           9.3
62  2010           9.6
63  2011           8.9
64  2012           8.1

[65 rows x 2 columns]

In [94]:
unemp.dtypes

Year              int64
Unemployment    float64
dtype: object

In [95]:
print unemp.Year.min()
print unemp.Year.max()

1948
2012

In [96]:
data_merged = annual_data.merge(unemp, how='left', left_index=True, right_on="Year")

In [97]:
 data_merged.head()

    Mean_Budget  Mean_Profit  Count  Year  Unemployment
64       110000   100.000000      1  1915           NaN
64       292953          NaN      2  1916           NaN
64       100000          NaN      1  1920           NaN
64      2072500    89.795918      2  1925           NaN
64      2000000          NaN      1  1927           NaN

In [98]:
data_merged.tail()

    Mean_Budget  Mean_Profit  Count  Year  Unemployment
61     42974651    91.226580    172  2009           9.3
62     39710400     3.276562    212  2010           9.6
63     43270404     3.934096    154  2011           8.9
64     75050300     9.694820     30  2012           8.1
64    270000000          NaN      1  2013           NaN

<h2> Explaining the .merge dataframe arguments </h2>

<p>
Let's take a closer look at what happened here. The merge(...) method of a DataFrame is used to merge that
DataFrame (known by convention as the left-hand DataFrame) with another one (the right-hand DataFrame),
provided as the first argument. DataFrames are merged by finding rows that match on some criteria, and
combining them. We provide the criteria in in the left_ or right_ index= or on= arguments. In the example above,
we're saying to merge rows where the left-hand index matches right-hand Year column.
</p>

<p>
The how= argument is the type of join to use, a concept you may be familiar with from SQL. There are three
types of joins:
<p>

<list>
<li>
left-join means keep all the rows from the left-hand dataset, and merge in any matching right-hand
rows.
</li>

<li>
right-join means keep all the rows from the right-hand dataset, and merge in any matching left-hand
rows.
</li>

<li>
inner-join means keep and merge only rows where there's a match between the left- and right-hand
datasets
</li>

</list>

In this case, the indices on the right-hand dataset are a subset of the left-hand indices, so a right and an inner
join are equivalent. Let's quickly see what those results would look like:

In [100]:
temp = annual_data.merge(unemp, how='right', left_index=True, right_on="Year")

In [101]:
temp.head()

   Mean_Budget  Mean_Profit  Count  Year  Unemployment
0      3350000          NaN      2  1948           3.8
1      1300000          NaN      2  1949           6.1
2      3334392          NaN      2  1950           5.2
3      2958333          NaN      6  1951           3.3
4      2423333          NaN      3  1952           3.0

In [102]:
temp.tail()

    Mean_Budget  Mean_Profit  Count  Year  Unemployment
60     38956836     2.981165    177  2008           5.8
61     42974651    91.226580    172  2009           9.3
62     39710400     3.276562    212  2010           9.6
63     43270404     3.934096    154  2011           8.9
64     75050300     9.694820     30  2012           8.1

<p> Notice that the merge(...) method returns a new DataFrame, without modifying the original DataFrame. Notice
also that the resulting DataFrame has a different index; whereas previously the left-hand DataFrame was
indexed on Year, the merged DataFrame has a simple row-count index, with Year now an ordinary column.
</p>

if we want to, we can set the Year column as the index, using the set_index(...) method:

In [104]:
data_merged = data_merged.set_index("Year")

In [105]:
data_merged.head()

      Mean_Budget  Mean_Profit  Count  Unemployment
Year
1915       110000   100.000000      1           NaN
1916       292953          NaN      2           NaN
1920       100000          NaN      1           NaN
1925      2072500    89.795918      2           NaN
1927      2000000          NaN      1           NaN

Notice that we're assigning the result of set_index(...) to the data_merged DataFrame itself -- again, by default it
returns a new DataFrame, without modifying the original one. With most methods, instead of assigning the new
DataFrame to the old name, we can use the inplace argument, like this:

In [106]:
# Reset the index, and make the old index
data_merged.reset_index(inplace=True)

In [107]:
data_merged.head()

   Year  Mean_Budget  Mean_Profit  Count  Unemployment
0  1915       110000   100.000000      1           NaN
1  1916       292953          NaN      2           NaN
2  1920       100000          NaN      1           NaN
3  1925      2072500    89.795918      2           NaN
4  1927      2000000          NaN      1           NaN

In [108]:
data_merged.head()

   Year  Mean_Budget  Mean_Profit  Count  Unemployment
0  1915       110000   100.000000      1           NaN
1  1916       292953          NaN      2           NaN
2  1920       100000          NaN      1           NaN
3  1925      2072500    89.795918      2           NaN
4  1927      2000000          NaN      1           NaN

In [109]:
#Now that we have our data together, we could see whether there are any annual correlations in our data:

data_merged.corr()

                  Year  Mean_Budget  Mean_Profit     Count  Unemployment
Year          1.000000     0.556962    -0.327954  0.707824      0.389024
Mean_Budget   0.556962     1.000000    -0.326110  0.308479      0.296792
Mean_Profit  -0.327954    -0.326110     1.000000 -0.297851      0.079646
Count         0.707824     0.308479    -0.297851  1.000000      0.068876
Unemployment  0.389024     0.296792     0.079646  0.068876      1.000000

It looks like unemployment doesn't correlate at all with either the number of movies, or how profitable they are,
and only slightly correlates with their budget.

In [2]:
import pandas
import random
z = [random.normalvariate(0,1) for x in range(120)]

In [4]:
type(z)

list